package challenge11;

public class Ad {

	public static void main(String[] args) {
		

//		トラブルメーカー社は中古車販売を始めました。現在は3台のみで「軽自動車」、「ファミリーカー」の車種を扱っています。広告掲載として軽自動車は、車種名、燃費、乗員、金額、エアコン有無の5項目掲載します。ファミリーカーは、車種名、燃費、乗員、金額、排気量、自動運転有無の6項目表示します。
//		この広告表示をプログラムで行ってください。また将来的には台数を増やしますし、スーパーカー、トラックなども取り扱う予定ですので、その際にプログラム修正が少なくすむように考慮してください。
//		現在保有車種
//
//
//
//		車種名：A
//		種別：軽自動車
//		燃費：22
//		乗員：4
//		金額：300000
//		エアコン有無：有り
//		 
//		車種名：B
//		種別：軽自動車
//		燃費：23
//		乗員：4
//		金額：280000
//		エアコン有無：無し
//		 
//		車種名：H
//		種別：ファミリーカー
//		燃費：18
//		乗員：5
//		金額：450000
//		排気量：1000
//		自動運転有無：有
//
//		広告表示例
//
//
//
//

//		A
//		金額：300000
//		燃費：22 乗員4
//		エアコン：有り
//		 
//		B
//		金額：280000
//		燃費：23 乗員4
//		エアコン：無し
//		 
//		H
//		金額：450000
//		燃費：18　乗員：5
//		排気量：1000
//		自動運転有無：有

	}

}
